Revit 2026 API

# WaveWaveRandomSeed Property

---

The property labeled "Random Seed" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveRandomSeed { get; }
```
```vb
Public Shared ReadOnly Property WaveRandomSeed As String
	Get
```
```cpp
public:
static property String^ WaveRandomSeed {
	String^ get ();
}
```
```fsharp
static member WaveRandomSeed : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" within the range of "0, 65535".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace